## [dev-efs](https://walter.app.spacelift.io/stack/dev-efs/run/01HXD2TQ4ZK898CYPGCGR8F0XT) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HXCF1T9PYJD96GBAERH7X4X9] Planning changes with 0 custom hooks...
time=2024-05-08T21:50:23Z level=info msg=The stack at /mnt/workspace/source/infra/dev-efs will be processed in the following order for command plan:
Group 1
- Module /mnt/workspace/source/infra/dev-efs/us-east-1/playground/efs



Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policy" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "NonSecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "elasticfilesystem:ClientMount",
              + "elasticfilesystem:ClientRootAccess",
              + "elasticfilesystem:ClientWrite",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "NonSecureTransportAccessedViaMountTarget"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "true",
                ]
              + variable = "elasticfilesystem:AccessedViaMountTarget"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_efs_backup_policy.this[0] will be created
  + resource "aws_efs_backup_policy" "this" {
      + file_system_id = (known after apply)
      + id             = (known after apply)

      + backup_policy {
          + status = "DISABLED"
        }
    }

  # aws_efs_file_system.this[0] will be created
  + resource "aws_efs_file_system" "this" {
      + arn                     = (known after apply)
      + availability_zone_id    = (known after apply)
      + availability_zone_name  = (known after apply)
      + creation_token          = "dev-efs-playground"
      + dns_name                = (known after apply)
      + encrypted               = true
      + id                      = (known after apply)
      + kms_key_id              = (known after apply)
      + name                    = (known after apply)
      + number_of_mount_targets = (known after apply)
      + owner_id                = (known after apply)
      + performance_mode        = "generalPurpose"
      + size_in_bytes           = (known after apply)
      + tags                    = {
          + "Entity"      = "efs"
          + "Environment" = "dev-efs-playground"
          + "Name"        = "dev-efs-playground"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                = {
          + "Entity"      = "efs"
          + "Environment" = "dev-efs-playground"
          + "Name"        = "dev-efs-playground"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + throughput_mode         = "bursting"
    }

  # aws_efs_file_system_policy.this[0] will be created
  + resource "aws_efs_file_system_policy" "this" {
      + bypass_policy_lockout_safety_check = false
      + file_system_id                     = (known after apply)
      + id                                 = (known after apply)
      + policy                             = (known after apply)
    }

  # aws_efs_mount_target.this["us-east-1a"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0f50886fa69747fb3"
    }

  # aws_efs_mount_target.this["us-east-1b"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-06b6057974d274b3b"
    }

  # aws_efs_mount_target.this["us-east-1c"] will be created
  + resource "aws_efs_mount_target" "this" {
      + availability_zone_id   = (known after apply)
      + availability_zone_name = (known after apply)
      + dns_name               = (known after apply)
      + file_system_arn        = (known after apply)
      + file_system_id         = (known after apply)
      + id                     = (known after apply)
      + ip_address             = (known after apply)
      + mount_target_dns_name  = (known after apply)
      + network_interface_id   = (known after apply)
      + owner_id               = (known after apply)
      + security_groups        = (known after apply)
      + subnet_id              = "subnet-0bd8c0b736e63beb2"
    }

  # aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "dev-efs-playground EFS security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "dev-efs-playground-efs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = true
      + tags                   = {
          + "Entity"      = "efs"
          + "Environment" = "dev-efs-playground"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all               = {
          + "Entity"      = "efs"
          + "Environment" = "dev-efs-playground"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc_id                 = "vpc-05021b0fb1bcc3891"
    }

  # aws_security_group_rule.this["vpc"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "10.12.0.0/24",
          + "10.12.1.0/24",
          + "10.12.2.0/24",
        ]
      + description              = "NFS ingress from VPC private subnets"
      + from_port                = 2049
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 2049
      + type                     = "ingress"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + access_points                                        = {}
  + arn                                                  = (known after apply)
  + dns_name                                             = (known after apply)
  + id                                                   = (known after apply)
  + mount_targets                                        = {
      + us-east-1a = {
          + availability_zone_id   = (known after apply)
          + availability_zone_name = (known after apply)
          + dns_name               = (known after apply)
          + file_system_arn        = (known after apply)
          + file_system_id         = (known after apply)
          + id                     = (known after apply)
          + ip_address             = (known after apply)
          + mount_target_dns_name  = (known after apply)
          + network_interface_id   = (known after apply)
          + owner_id               = (known after apply)
          + security_groups        = (known after apply)
          + subnet_id              = "subnet-0f50886fa69747fb3"
          + timeouts               = null
        }
      + us-east-1b = {
          + availability_zone_id   = (known after apply)
          + availability_zone_name = (known after apply)
          + dns_name               = (known after apply)
          + file_system_arn        = (known after apply)
          + file_system_id         = (known after apply)
          + id                     = (known after apply)
          + ip_address             = (known after apply)
          + mount_target_dns_name  = (known after apply)
          + network_interface_id   = (known after apply)
          + owner_id               = (known after apply)
          + security_groups        = (known after apply)
          + subnet_id              = "subnet-06b6057974d274b3b"
          + timeouts               = null
        }
      + us-east-1c = {
          + availability_zone_id   = (known after apply)
          + availability_zone_name = (known after apply)
          + dns_name               = (known after apply)
          + file_system_arn        = (known after apply)
          + file_system_id         = (known after apply)
          + id                     = (known after apply)
          + ip_address             = (known after apply)
          + mount_target_dns_name  = (known after apply)
          + network_interface_id   = (known after apply)
          + owner_id               = (known after apply)
          + security_groups        = (known after apply)
          + subnet_id              = "subnet-0bd8c0b736e63beb2"
          + timeouts               = null
        }
    }
  + security_group_arn                                   = (known after apply)
  + security_group_id                                    = (known after apply)
  + size_in_bytes                                        = (known after apply)
time=2024-05-08T21:50:49Z level=info msg=time=2024-05-08T21:50:39Z level=warning msg=Detected that init is needed, but Auto-Init is disabled. Continuing with further actions, but subsequent terraform commands may fail. prefix=[/mnt/workspace/source/infra/dev-efs/us-east-1/playground/efs] 

[01HXCF1T9PYJD96GBAERH7X4X9] Successfully planned changes
[01HXCF1T9PYJD96GBAERH7X4X9] Retrieving the dependency graph...
[01HXCF1T9PYJD96GBAERH7X4X9] Getting path for module /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc
time=2024-05-08T21:50:50Z level=info msg=Downloading Terraform configurations from git::https://github.com/terraform-aws-modules/terraform-aws-vpc.git?ref=v5.7.2 into /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic
[01HXCF1T9PYJD96GBAERH7X4X9] Getting path for module us-east-1/playground/efs
[01HXCF1T9PYJD96GBAERH7X4X9] Storing original state file for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic module
╷
│ Error: Failed to read the given file as a state or plan file
│ 
│ State read error: Error loading statefile: open spacelift.plan: no such
│ file or directory
│ 
│ Plan read error: open spacelift.plan: no such file or directory
╵
[01HXCF1T9PYJD96GBAERH7X4X9] Could not fetch a plan for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic module: unexpected exit code when running show command: 1; plan for this module might be degraded
[01HXCF1T9PYJD96GBAERH7X4X9] unexpected exit code when running show command: 1
[01HXCF1T9PYJD96GBAERH7X4X9] Uploading the list of managed resources...
[01HXCF1T9PYJD96GBAERH7X4X9] Retrieving the dependency graph...
[01HXCF1T9PYJD96GBAERH7X4X9] Getting path for module /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc
[01HXCF1T9PYJD96GBAERH7X4X9] Getting path for module us-east-1/playground/efs
[01HXCF1T9PYJD96GBAERH7X4X9] Analyzing plan for module /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc in directory /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic
[01HXCF1T9PYJD96GBAERH7X4X9] Uploading the list of managed resources...
╷
│ Error: Failed to read the given file as a state or plan file
│ 
│ State read error: Error loading statefile: open spacelift.plan: no such
│ file or directory
│ 
│ Plan read error: open spacelift.plan: no such file or directory
╵
[01HXCF1T9PYJD96GBAERH7X4X9] Uploading the list of managed resources failed: unexpected exit code when running show command: 1
[01HXCF1T9PYJD96GBAERH7X4X9] user workflow failure
[01HXCF1T9PYJD96GBAERH7X4X9] Generating JSON representations of the plans...
[01HXCF1T9PYJD96GBAERH7X4X9] Retrieving the dependency graph...
[01HXCF1T9PYJD96GBAERH7X4X9] Getting path for module /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc
[01HXCF1T9PYJD96GBAERH7X4X9] Getting path for module us-east-1/playground/efs
[01HXCF1T9PYJD96GBAERH7X4X9] Generating JSON representation of the plan for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic ...
╷
│ Error: Failed to read the given file as a state or plan file
│ 
│ State read error: Error loading statefile: open spacelift.plan: no such
│ file or directory
│ 
│ Plan read error: open spacelift.plan: no such file or directory
╵
[01HXCF1T9PYJD96GBAERH7X4X9] Could not generate JSON representation of the plan: unexpected exit code when running show command: 1
[01HXCF1T9PYJD96GBAERH7X4X9] unexpected exit code when running show command: 1
[01HXCF1T9PYJD96GBAERH7X4X9] Loading custom plan policy inputs...
[01HXCF1T9PYJD96GBAERH7X4X9] 0 custom plan policy inputs found
[01HXCF1T9PYJD96GBAERH7X4X9] No plan policies to evaluate
```

</details>